{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_4",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            224,
                            224,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input1"
                    }
                },
                {
                    "class_name": "Rescaling",
                    "config": {
                        "scale": 0.00784313725490196,
                        "offset": -1,
                        "name": "rescaling_Rescaling1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Functional",
                    "config": {
                        "name": "model",
                        "layers": [
                            {
                                "name": "input_2",
                                "class_name": "InputLayer",
                                "config": {
                                    "batch_input_shape": [
                                        null,
                                        224,
                                        224,
                                        3
                                    ],
                                    "dtype": "float32",
                                    "sparse": false,
                                    "name": "input_2"
                                },
                                "inbound_nodes": []
                            },
                            {
                                "name": "resnet50v2",
                                "class_name": "Functional",
                                "config": {
                                    "name": "resnet50v2",
                                    "layers": [
                                        {
                                            "name": "input_3",
                                            "class_name": "InputLayer",
                                            "config": {
                                                "batch_input_shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float32",
                                                "sparse": false,
                                                "name": "input_3"
                                            },
                                            "inbound_nodes": []
                                        },
                                        {
                                            "name": "conv1_pad",
                                            "class_name": "ZeroPadding2D",
                                            "config": {
                                                "padding": [
                                                    [
                                                        3,
                                                        3
                                                    ],
                                                    [
                                                        3,
                                                        3
                                                    ]
                                                ],
                                                "data_format": "channels_last",
                                                "name": "conv1_pad",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "input_3",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv1_conv",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 64,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    7,
                                                    7
                                                ],
                                                "strides": [
                                                    2,
                                                    2
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": true,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "conv1_conv",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv1_pad",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "pool1_pad",
                                            "class_name": "ZeroPadding2D",
                                            "config": {
                                                "padding": [
                                                    [
                                                        1,
                                                        1
                                                    ],
                                                    [
                                                        1,
                                                        1
                                                    ]
                                                ],
                                                "data_format": "channels_last",
                                                "name": "pool1_pad",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv1_conv",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "pool1_pool",
                                            "class_name": "MaxPooling2D",
                                            "config": {
                                                "pool_size": [
                                                    3,
                                                    3
                                                ],
                                                "padding": "valid",
                                                "strides": [
                                                    2,
                                                    2
                                                ],
                                                "data_format": "channels_last",
                                                "name": "pool1_pool",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "pool1_pad",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_preact_bn",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": [
                                                    3
                                                ],
                                                "momentum": 0.99,
                                                "epsilon": 0.00001001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "conv2_block1_preact_bn",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "pool1_pool",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_preact_relu",
                                            "class_name": "Activation",
                                            "config": {
                                                "activation": "relu",
                                                "name": "conv2_block1_preact_relu",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_preact_bn",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_1_conv",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 64,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "conv2_block1_1_conv",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_preact_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_1_bn",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": [
                                                    3
                                                ],
                                                "momentum": 0.99,
                                                "epsilon": 0.00001001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "conv2_block1_1_bn",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_1_conv",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_1_relu",
                                            "class_name": "Activation",
                                            "config": {
                                                "activation": "relu",
                                                "name": "conv2_block1_1_relu",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_1_bn",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_2_pad",
                                            "class_name": "ZeroPadding2D",
                                            "config": {
                                                "padding": [
                                                    [
                                                        1,
                                                        1
                                                    ],
                                                    [
                                                        1,
                                                        1
                                                    ]
                                                ],
                                                "data_format": "channels_last",
                                                "name": "conv2_block1_2_pad",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_1_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_2_conv",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 64,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    3,
                                                    3
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "conv2_block1_2_conv",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_2_pad",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_2_bn",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": [
                                                    3
                                                ],
                                                "momentum": 0.99,
                                                "epsilon": 0.00001001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "conv2_block1_2_bn",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_2_conv",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_2_relu",
                                            "class_name": "Activation",
                                            "config": {
                                                "activation": "relu",
                                                "name": "conv2_block1_2_relu",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_2_bn",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_0_conv",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 256,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": true,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "conv2_block1_0_conv",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_preact_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_3_conv",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 256,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": true,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "conv2_block1_3_conv",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_2_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block1_out",
                                            "class_name": "Add",
                                            "config": {
                                                "name": "conv2_block1_out",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_0_conv",
                                                        0,
                                                        0,
                                                        {}
                                                    ],
                                                    [
                                                        "conv2_block1_3_conv",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block2_preact_bn",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": [
                                                    3
                                                ],
                                                "momentum": 0.99,
                                                "epsilon": 0.00001001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "conv2_block2_preact_bn",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block1_out",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block2_preact_relu",
                                            "class_name": "Activation",
                                            "config": {
                                                "activation": "relu",
                                                "name": "conv2_block2_preact_relu",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block2_preact_bn",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block2_1_conv",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 64,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "conv2_block2_1_conv",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block2_preact_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block2_1_bn",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": [
                                                    3
                                                ],
                                                "momentum": 0.99,
                                                "epsilon": 0.00001001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "conv2_block2_1_bn",
                                                "trainable": false
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "conv2_block2_1_conv",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "conv2_block2_1_relu",
